ImperialSpaceSociety/Project-Mach-1/Flight computer/Software/Custom board files for flight computer/1.5.9/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.cache=Cache
menu.speed=CPU Speed
menu.opt=Optimize
menu.maxqspi=Max QSPI
menu.usbstack=USB Stack
menu.debug=Debug


# Adafruit ItsyBitsy M0 (SAMD21)
# ------------------------------
adafruit_itsybitsy_m0.name=Adafruit ItsyBitsy M0
adafruit_itsybitsy_m0.vid.0=0x239A
adafruit_itsybitsy_m0.pid.0=0x800F
adafruit_itsybitsy_m0.vid.1=0x239A
adafruit_itsybitsy_m0.pid.1=0x000F
adafruit_itsybitsy_m0.vid.2=0x239A
adafruit_itsybitsy_m0.pid.2=0x8012
adafruit_itsybitsy_m0.upload.tool=bossac
adafruit_itsybitsy_m0.upload.protocol=sam-ba
adafruit_itsybitsy_m0.upload.maximum_size=262144
adafruit_itsybitsy_m0.upload.offset=0x2000
adafruit_itsybitsy_m0.upload.use_1200bps_touch=true
adafruit_itsybitsy_m0.upload.wait_for_upload_port=true
adafruit_itsybitsy_m0.upload.native_usb=true
adafruit_itsybitsy_m0.build.mcu=cortex-m0plus
adafruit_itsybitsy_m0.build.f_cpu=48000000L
adafruit_itsybitsy_m0.build.usb_product="ItsyBitsy M0 Express"
adafruit_itsybitsy_m0.build.usb_manufacturer="Adafruit"
adafruit_itsybitsy_m0.build.board=ITSYBITSY_M0
adafruit_itsybitsy_m0.build.core=arduino
adafruit_itsybitsy_m0.build.extra_flags=-DCRYSTALLESS -DADAFRUIT_ITSYBITSY_M0 -D__SAMD21G18A__ -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_itsybitsy_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_itsybitsy_m0.build.openocdscript=openocd_scripts/itsybitsy_m0.cfg
adafruit_itsybitsy_m0.build.variant=itsybitsy_m0
adafruit_itsybitsy_m0.build.variant_system_lib=
adafruit_itsybitsy_m0.build.vid=0x239A
adafruit_itsybitsy_m0.build.pid=0x800F
adafruit_itsybitsy_m0.bootloader.tool=openocd
adafruit_itsybitsy_m0.bootloader.file=itsybitsyM0/bootloader-itsybitsy_m0-v2.0.0-adafruit.5.bin
adafruit_itsybitsy_m0.menu.usbstack.arduino=Arduino
adafruit_itsybitsy_m0.menu.usbstack.tinyusb=TinyUSB
adafruit_itsybitsy_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
adafruit_itsybitsy_m0.menu.debug.off=Off
adafruit_itsybitsy_m0.menu.debug.on=On
adafruit_itsybitsy_m0.menu.debug.on.build.flags.debug=-g



# Rocket Flight Computer (SAMD21)
# ------------------------------
rocket_flight_computer.name=rocket_flight_computer
rocket_flight_computer.vid.0=0x239A
rocket_flight_computer.pid.0=0x800F
rocket_flight_computer.vid.1=0x239A
rocket_flight_computer.pid.1=0x000F
rocket_flight_computer.vid.2=0x239A
rocket_flight_computer.pid.2=0x8012
rocket_flight_computer.upload.tool=bossac
rocket_flight_computer.upload.protocol=sam-ba
rocket_flight_computer.upload.maximum_size=262144
rocket_flight_computer.upload.offset=0x2000
rocket_flight_computer.upload.use_1200bps_touch=true
rocket_flight_computer.upload.wait_for_upload_port=true
rocket_flight_computer.upload.native_usb=true
rocket_flight_computer.build.mcu=cortex-m0plus
rocket_flight_computer.build.f_cpu=48000000L
rocket_flight_computer.build.usb_product="rocket_flight_computer"
rocket_flight_computer.build.usb_manufacturer="Imperial College Space Society"
rocket_flight_computer.build.board=rocket_flight_computer
rocket_flight_computer.build.core=arduino
rocket_flight_computer.build.extra_flags=-DCRYSTALLESS -DFLIGHT_COMPUTER -D__SAMD21J18A__ -DARM_MATH_CM0PLUS {build.usb_flags}
rocket_flight_computer.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
rocket_flight_computer.build.openocdscript=openocd_scripts/flight_computer_m0.cfg
rocket_flight_computer.build.variant=rocket_flight_computer
rocket_flight_computer.build.variant_system_lib=
rocket_flight_computer.build.vid=0x239A
rocket_flight_computer.build.pid=0x800F
rocket_flight_computer.bootloader.tool=openocd
rocket_flight_computer.bootloader.file=itsybitsyM0/bootloader-itsybitsy_m0-v2.0.0-adafruit.5.bin
rocket_flight_computer.menu.usbstack.arduino=Arduino
rocket_flight_computer.menu.usbstack.tinyusb=TinyUSB
rocket_flight_computer.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
rocket_flight_computer.menu.debug.off=Off
rocket_flight_computer.menu.debug.on=On
rocket_flight_computer.menu.debug.on.build.flags.debug=-g
